{
	"lo_what": {
		"id": "lo_what",
		"name": "Accessibility is about making technology &ldquo;usable by everyone, regardless of their abilities or disabilities&rdquo;*",
		"arg": "This is important to web development because... (LO argument)",
		"material": "<p><span>*(</span><a href=\"http://teachaccess.org/about/\"><span>http://teachaccess.org/about/</span></a><span>). </span></p> <p><em><span>&ldquo;People have all kinds of ability. If you design without accounting for variation in ability, your design will fail. Designs that account for all abilities are called accessible designs.&rdquo; (Andy Ko)</span></em></p> <p><span>According to the World Health Organization,</span></p> <p><span>&ldquo;Disability is not just a health problem. It is a complex phenomenon, reflecting the interaction between features of a person&rsquo;s body and features of the society in which he or she lives.&rdquo;</span></p> <p><span>To put this more concretely, not being able to hear your conversational partner is no hindrance if you are speaking to each other in sign language.</span></p>",
		"options": [ "brief", "indepth", "activity" ]
	},
	"lo_kinds": {
		"id": "lo_kinds",
		"name": "There are many different kinds of abilities and disabilities (visual, hearing, cognitive, motor, etc), and all of these can range from situational to permanent",
		"arg": "This is important to web development because... (LO argument)",
		"material": "<p><span>One way to convey the wide range of abilities and disabilities is to show students examples in each of these categories:</span></p> <ul> <li><span>Vision</span></li> <ul> <li><span>Blind</span></li> <li><span>Low-Vision</span></li> <li><span>Color Blind</span></li> </ul> <li><span>Hearing</span></li> <ul> <li><span>Deaf</span></li> <li><span>Hard of Hearing</span></li> </ul> <li><span>Speech</span></li> <ul> <li><span>Ability to speak</span></li> <li><span>Speed impediments</span></li> </ul> <li><span>Mobility</span></li> <ul> <li><span>Ability to walk</span></li> <li><span>Ability to use limbs</span></li> </ul> <li><span>Cognitive</span></li> <ul> <li><span>Dyslexia, dysgraphia, dyscalculia</span></li> <li><span>ADHD</span></li> <li><span>Memory loss</span></li> <li><span>Learning disabilities</span></li> </ul> <li><span>Behavioral</span></li> <ul> <li><span>Bipolar</span></li> </ul> </ul>  <p><span>Another is to share statistics on their prevalence:</span></p> <ul> <li><span>About 1 in 7 worldwide have a disability</span></li> <li><span>More than 15% of K12 students have a disability</span></li> <ul> <li><span>Source: Reports of IEP and Section 504 accommodations from U.S. public schools. (via Andy Ko&rsquo;s slides)</span></li> </ul> <li><span>Table of percentages from U.S. Census Bureau from 2002: (via Andy Ko&rsquo;s slides)</span></li> </ul> <p><span>To illustrate how these (dis)abilities can be situational, temporary, and permanent, this graphic may help (source: </span><a href=\"https://www.microsoft.com/en-us/design/inclusive\"><span>https://www.microsoft.com/en-us/design/inclusive</span></a><span>). The graphic doesn&rsquo;t include cognitive impairments, but being tired or drunk would be a situational variant, while chronic sleep deprivation (due to being a new parent for example) would be temporary, whereas dyslexia or Down syndrome are permanent.</span></p> <img src=\"/content-media/inclusivedesign.jpg\" alt=\"Touch: permanent one arm, temporary hurt arm, situational holding a baby...\" width=\"500\"> <p>The following anecdote shows <a href=\"https://www.thestar.com/news/insight/2016/01/16/when-us-air-force-discovered-the-flaw-of-averages.html\"><span>why the concept of an &ldquo;average&rdquo; person can be misleading</span></a>:</p> <p><span>In 1950 the US Air Force was trying to figure out how to redesign airplane cockpits to reduce accidents, and decided to take over 4000 pilots and average their measurements along 140 different metrics, such as thumb length, crotch height, and the distance from a pilot&rsquo;s eye to his ear, in order to design a cockpit to better fit the average pilot. However, one of their scientists had doubts about this method, so he chose ten metrics that he thought would be most important for the design, generously defined average to be in the middle 30% around the mean for each of the ten dimensions, and found that not one of the measured pilots fit those criteria. Even if he only chose three dimensions, only 3.5% of pilots were &ldquo;average.&rdquo;</span></p>",
		"options": [ "brief", "indepth", "activity" ]
	},
  "lo_sr": {
    "id": "lo_sr",
    "name": "Screen readers read structured \"documents\" as speech",
    "material": [
      "\"Documents\" includes things we think of as documents (mostly text, maybe some headings and images) but also more complicated things like web pages or user interfaces",
      "Screen readers expose structure (headings, lists, menus, etc) in different ways which often enable easier navigation to desired content",
      "Expert screen reader users form their own ways of using them (e.g. at high playback speeds) that are not necessarily comparable to novice screen reader users",
      [
        "(testing something yourself is different from having an expert screen reader user do it)",
        "(video demo for them or students?)"
      ]
    ],
    "arg": "Screen readers are a common way that blind or low-vision people interact with the web, so it's good for students to know about them. Since they're ubiquitous, they can also be used as a demo, and to introduce the idea of serving everyone."
  },
  "lo_struct_word": {
    "id": "lo_struct_word",
    "name": "Specify and expose as much structural metadata as possible in word documents",
    "material": [
      "Use a document editor's styles in order to organize sections and subsections",
      "Use a document editor's lists (ordered or unordered) instead of making your own equivalent",
      "Set alt text for your images (this provides a textual description for anyone who can't see them--more on how to do good ones later)",
      "..."
    ],
    "arg": "Word, Google Docs, and other similar software provide a common way to share information. There are a few simple but key tricks to expose document structure to screen readers, some of which also provide benefits beyond accessibility concerns."
  },
  "lo_struct_html": {
    "id": "lo_struct_html",
    "name": "Specify and expose as much structural metadata as possible in HTML documents",
    "material": [
      "Use heading tags to structure sections and subsections",
      "Use list tags (ordered or unordered) instead of making your own equivalent",
      "Use table heading tags to provide information about the structure of information in a table",
      [
        "<table> comes with tr/td/th",
        "Fancier things possible if a header spans multiple rows or cols: https://www.washington.edu/accesscomputing/tip-8-markup-tables-appropriately"
      ],
      "In general, use the most specific HTML tag to your situation (e.g. use <button> instead of a <div> styled to act like a button)",
      [
        "This also adds a button to a tab order for keyboard navigation purposes, so it's not just for people with screen readers"
      ],
      "If that's not possible, set the \"role\" attribute of a tag",
      "Even if there isn't a specific HTML tag, there may be a role attribute that fits anyway (e.g. role=\"search\" for a search widget)",
      "Roles are part of WAI-ARIA (Web Accessibility Initiative, Accessible Rich Internet Applications) (link to accessibility standards/ARIA)"
    ],
    "arg": "HTML is one of the best ways to provide accessible documents when used correctly, since the tags it uses to mark up the information it represents can also be used to understand a pages structure. This page provides some examples, beyond more readable and easier-to-understand code, to use core features of the language rather than reinventing the wheel."
  },
  "lo_pdf": {
    "id": "lo_pdf",
    "name": "PDFs are difficult to make accessible and other formats should be used where possible",
    "material": [
      "The original intention of the pdf format was to preserve a fixed visual representation",
      "As such, PDFs often discard structural information (headings, text order, etc) or even the fact that text is text",
      "In order to link the structure of the pdf as metadata that a screen reader can perceive, a pdf must be tagged (tag is used here in the sense it has in HTML, where tags can automatically provide metadata about their content)",
      [
        "MS Word can export a tagged PDF on Windows, although often post-processing is required to correct errors such as text order around images",
        "The professional version of Adobe Reader can be used to manually check for and adjust tags",
        "A more specific pipeline can be found here if you ever need to do this process: (link)"
      ]
    ],
    "arg": "PDFs are a common way to share information since they preserve a fixed visual representation and can be opened on any operating system. However, students should understand their drawbacks when it comes to accessibility, and how to make them accessible if they are constrained to use them."
  },
  "lo_gp": {
    "id": "lo_gp",
    "name": "The HTML standard includes ways to group input fields with labels so that they're associated together",
    "material": [
      "Why? In forms, this exposes information usually encoded in the visual layout (e.g. by always having a label for an input field directly above it) to someone who can't see the screen.",
      "To do this:",
      [
        "Enclose the input field in a <label> tag",
        "Use aria-labelledby and for attributes (?)",
        "Also add an extra aria-label when format is so visually obvious, e.g. three fields for telephone number, that it doesn't need a label visible to everyone",
        "aria-described-by (when a label is insufficient, so a field is also associated with e.g. extra help text)"
      ],
      "Do make sure labels are meaningful and unique, but they shouldn't be too verbose",
      "In general, grouping is also helpful if it makes sure a caption gets associated with the image its for",
      "[Provide checkbox/radio buttons example]"
    ],
    "arg": "This exposes students to a different way in which HTML markup can be used for non-obvious but useful tasks. Grouping in this way is an important concept because it forces students to reconsider the assumption that visual organization is all the organization that is needed."
  }
}
